{"format": "layers-model", "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [2, 10], "name": "dense/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense/bias"}, {"dtype": "float32", "shape": [10, 100], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [100], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [100, 784], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [784], "name": "dense_2/bias"}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"units": 10, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "name": "dense", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "batch_input_shape": [null, 2], "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 100, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 784, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dtype": "float32"}}], "name": "sequential"}}, "backend": "tensorflow"}, "convertedBy": "TensorFlow.js Converter v1.0.1", "generatedBy": "keras v2.2.4-tf"}